import React from "react";
import "./coverLetter.css";

const CoverLetter = () => {
  return (
    <>
      <div className="letter-container">
        <a href="https://ivanbuzduha.github.io/personal-portfolio/"> Іван Буздуга</a>
        <ul className="letter-list">
          {/* <li className="list-item name">
            
          </li> */}
          <li className="list-item ">
            <a href="tel:+380683182732"> +380683182732</a>
          </li>
          <li className="list-item">
            <p>Київ</p>
          </li>
          <li className="list-item">
            <a href="mailto:ivanbuzduha@gmail.com">ivanbuzduha@gmail.com</a>
          </li>
        </ul>{" "}
        <p className="letter-text">
          Шановний(-а)<span className="greeting"> [Ім'я Отримувача],</span>Я пишаюся представити Вам свою кандидатуру на роль
          Front-end розробника в <span className="greeting">[Назва Компанії]</span> . За останні півроку я активно працював над
          розвитком своїх навичок у Javascript, React, HTML та CSS, і готовий приносити свій внесок у вашу команду. Моя
          пристрасть до фронтенд-розробки почалася під час мого навчання, і зараз я маю піврічний досвід роботи з цими
          технологіями. Під час цього періоду я успішно виконував завдання з розробки веб-сайтів та веб-додатків, використовуючи
          сучасні підходи та найкращі практики. Основні навички та досягнення, які я приніс з собою: Впевнений досвід у розробці
          динамічних веб-сторінок з використанням Javascript, React, що включає в себе маніпуляцію DOM, роботу з AJAX запитами
          та роботу зі сторонніми API. Знання сучасних стандартів HTML5 та CSS3, а також досвід в їх ефективному використанні
          для створення стильних та користувацьких дружніх інтерфейсів. Вміння працювати з різними фреймворками та бібліотеками,
          такими як React, Tailwind та Bootstrap. Досвід роботи в командному середовищі, використовуючи системи контролю версій,
          такі як Git та Trello системою управління проєктами. Я зацікавлений у можливості приєднатися до вашої команди, де я
          зможу продовжити свій розвиток як фахівець з фронтенду та внести свій внесок у ваші проекти. Я готовий надати
          додаткову інформацію під час співбесіди. Дякую за увагу до моєї кандидатури. Я сподіваюся на можливість обговорити мою
          роль у вашій компанії та внести свій внесок у ваш успіх. З повагою, Іван Буздуга.
        </p>
      </div>
    </>
  );
};
export default CoverLetter;
