import React from "react";

const CoverLetter = () => {
  return (
    <>
      <div>
        [Ваше Прізвище та Ім'я] [Ваша Адреса] [Ваш Електронний Адрес] [Ваш Номер Телефону] [Дата] [Ім'я Отримувача] [Назва
        Компанії] [Адреса Компанії] [Електронна Адреса Компанії] Шановний(-а) [Ім'я Отримувача],
        <p>
          Я пишаюся представити Вам свою кандидатуру на роль Front-end розробника в [Назва Компанії]. За останні півроку я
          активно працював над розвитком своїх навичок у Javascript, HTML та CSS, і готовий приносити свій внесок у вашу
          команду. Моя пристрасть до фронтенд-розробки почалася під час мого навчання, і зараз я маю піврічний досвід роботи з
          цими технологіями. Під час цього періоду я успішно виконував завдання з розробки веб-сайтів та веб-додатків,
          використовуючи сучасні підходи та найкращі практики. Основні навички та досягнення, які я приніс(-ла) з собою:
          Впевнений досвід у розробці динамічних веб-сторінок з використанням Javascript, що включає в себе маніпуляцію DOM,
          роботу з AJAX запитами та роботу зі сторонніми API. Знання сучасних стандартів HTML5 та CSS3, а також досвід в їх
          ефективному використанні для створення стильних та користувацьких дружніх інтерфейсів. Вміння працювати з різними
          фреймворками та бібліотеками, такими як React, Vue.js та Bootstrap. Досвід роботи в командному середовищі,
          використовуючи системи контролю версій, такі як Git. Я зацікавлений(-а) у можливості приєднатися до вашої команди, де
          я зможу продовжити свій розвиток як фахівець з фронтенду та внести свій внесок у ваші проекти. Я готовий(-а) надати
          додаткову інформацію під час співбесіди. Дякую за увагу до моєї кандидатури. Я сподіваюся на можливість обговорити мою
          роль у вашій компанії та внести свій внесок у ваш успіх. З повагою, [Ваше Прізвище та Ім'я]
        </p>
      </div>
    </>
  );
};
export default CoverLetter;
